In [31]:
import pandas as pd
import numpy as np
from numpy.random import randn

labels = ['USA','India','Germany','Italy','Japan']
my_list = [10,20,30,40,50]
#arr = np.array([10,20,30,40])

pd.Series(data=my_list,index=labels)
df = pd.DataFrame(randn(5,4),index=labels,columns='W X Y Z'.split())
df

                W         X         Y         Z
USA     -1.306482 -1.632924  0.802129 -1.667537
India    0.608857  0.286473 -0.205792  2.493990
Germany -0.547260  0.496727 -1.235614 -0.798428
Italy    0.754121 -0.772041 -0.034432  0.688408
Japan    0.081523 -0.415191  0.053661 -2.115113

In [20]:
df[['W','X']]

          W         X
A -0.993263  0.196800
B  1.025984 -0.156598
C  2.154846 -0.610259
D  0.147027 -0.479448
E -0.925874  1.862864

In [38]:
df.drop('Z',axis=1,inplace=True)

In [41]:
df[df>0]

                W         X         Y
USA           NaN       NaN  0.802129
India    0.608857  0.286473       NaN
Germany       NaN  0.496727       NaN
Italy    0.754121       NaN       NaN
Japan    0.081523       NaN  0.053661

In [43]:
df.set_index('W')

                  X         Y
W
-1.306482 -1.632924  0.802129
 0.608857  0.286473 -0.205792
-0.547260  0.496727 -1.235614
 0.754121 -0.772041 -0.034432
 0.081523 -0.415191  0.053661

In [45]:
df

                W         X         Y
USA     -1.306482 -1.632924  0.802129
India    0.608857  0.286473 -0.205792
Germany -0.547260  0.496727 -1.235614
Italy    0.754121 -0.772041 -0.034432
Japan    0.081523 -0.415191  0.053661

In [46]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
pd